---
kind: type
id: T:Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace
source: html/cd0567d0-f5e0-a850-6d10-bde911831947.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace

Analytical space.

## Syntax (C#)
```csharp
public class EnergyAnalysisSpace : Element
```